___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions (like sums)

In [18]:
import pandas as pd
# Create dictionary of data dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [19]:
# Create dataframe based on the dictionary "data"
df = pd.DataFrame(data)

In [20]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [21]:
df.groupby('Company')

You can save this object as a new variable:

In [22]:
by_comp = df.groupby("Company") # store the groupby in variable first

And then call aggregate methods off the object:

In [23]:
by_comp.mean() 

# only when aggregate function is performed, will it present the new dataframe
# Person column disappears because you can't mean() aggregate strings

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [24]:
df.groupby('Company').mean()
#The 'Person' column does not show because you can't calculate the mean between strings, only numeric values

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [25]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [26]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [27]:
by_comp.min()
# This .max() on strings shows the Person name with the lowest first letter in the alphabet

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [28]:
by_comp.max()
# This .max() on strings shows the Person name with the highest first letter in the alphabet

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [29]:
by_comp.count()
# This time strings can be counted because it calculates the number of strings present in each company index

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [30]:
by_comp.describe()
#super useful for statistical analysis. For example this would be amazing for crystal size count

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [31]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [32]:
by_comp.describe().transpose()['GOOG']
#only describes data from GOOG

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Great Job!